/* TODO: Написать программу осуществляющую 10-ый сдвиг влево
	для целого 3-ч значного числа
*/

#include <stdio.h>

int main()
{
	int number = 784;
	number = number << 10;
	printf("Value number = %d\n", number);
	return 0;
}
